using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ToDoList : MonoBehaviour
{

    /*
    Штуки, которые нужно бы реализовать, чтобы это работало как хоть бы простенькая, но игра.
    Их многовато, так что запишем их и отложим потом, для более поздней реализации.

    - Вражеские пули, бьющие по игроку
    - Получение игроком ущера от вражеских пуль, хотя бы та же смена цвета
    Временная неуязвимость после попадания
    - Скрипты для разных выстрелов врагов
    Примитивный мини-боссфайт
    Добавить звуки и музыку
    Добавить меню - чтобы можно было начать единственный уровень, 
    вернуться в меню после его перепрохождения, выйти из игры.
    Бесконечный уровень с скроллящимся фоном как альтернатива боссфайту - враги время от времени появляются 
    бесконечно, так что игра на набор очков идет пока игрок не будет сбит.

    Раз от боссов перешли к феям - надо сделать спавн фей. Возможно, постепенно ускоряющийся. И с более 
    сильными феями. Но для начала, естественно, их надо сделать способными вообще атаковать. 

    Ладно, хватит и пары вещей.
    - Выход из игры после окончания - то есть после смерти для начала, меню-то нет.
    - Прицельная стрельба врагов.
    - Спавн врагов со временем.
    - Разные шоттайпы, возможно. Хоть для mvp и не обязательно.

    - реализовать счетчик врагов на экране, для внутренних нужд
    - поменять систему спавна на спавн по волнам 
    - добавить интефейс, отображающий количество жизней и счет игрока
    - добавить счетчик волн в интерфейсе
    - переделать систему выбора способа выстрела фей на более удобную в настройке.
    - добавить меню - старт игры, выход, рестарт

    - пофиксить не удаляющиеся пули
    - переименовать бутлег тоху в fairy hunt 
    добавить туда возможность указывать имя 
    сохранять рекорды
    - добавить бьющую в три струи разлетом градусов на 10 атаку для анфокуса
    */

    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
